"Back" = "Zurück";
"Continue" = "Continue without";
"create New User" = "Neues Profil anlegen";
"Create New User Info" = "Here you can create a personal TimeFor.TV profile. This helps you store your settings between devices and gives you extra features.";
"create Your New Account" = "Neues Profil anlegen";
"Email Address" = "E-Mailadresse";
"Your Email Address" = "E-Mailadresse";
"Login" = "Einloggen";
"Login Subscribtion Info" = "To get access to the full features of TimeFor.TV we recommended that you login with a profile.";
"Mobile" = "Handynummer für SMS-Erinnerungen";
"Name" = "Name";
"Password" = "Passwort";
"Register Mobile for SMS Info" = "* Your mobile no. will be used if you wish to receive SMS reminders. Please visit timefor.tv/products/sms for detailed information and conditions.";
"Add Channels" = "Sender hinzufügen";
"Channels" = "Sender";
"Channel.no.air.1" = "Sendepause";
"Channel.no.air.2" = "Tab to see full day";
"Channel.no.transmission.1" = "Keine Sendungen im Moment";
"Channel.no.transmission.2" = "Tab to see full day";
"Edit Channels Navigation Title " = "Sender bearbeiten";
"Please Select Channels before Adding" = "Please select channels before adding";
"Save" = "Beitrag senden";
"Search Channel" = "Search Channel";
"Search Programs" = "TV-Übersicht durchsuchen";
"Searched" = "Suche";
"Shows" = "Ansicht:";
"Synching Channels" = "Inhalt wird geladen";
"Today" = "Heute";
"Logout" = "Abmelden";
"Logout Cell" = "Sie sind angemeldet als";
"Push Notification Cell" = "Push notification devices";
"No Commercial" = "Werbung auf TimeFor.TV deaktiveren.";
"Recommendation" = "Empfehlungen";
"Recommend" = "Empfehlen";
"Don't recommend" = "Nicht empfehlen";
"Select Date" = "Tag auswählen";
"By Agent" = "By agent";
"Keyboard.done" = "Done";
"Segment.planned" = "Geplant";
"Segment.agents" = "Agenten";
"Edit planning" = "Planungen bearbeiten";
"Add planning" = "Planung";
"Edit" = "Bearbeiten";
"Edit agent" = "Bearbeiten";
"Add notification" = "Erinnerung hinzufügen";
"Search in" = "Suche in";
"Original Title" = "Originaltitle";
"Title" = "Titel";
"Summary" = "Zusammenfassung";
"All" = "Alle";
"Title or summary" = "Programmtitel oder Zusammenfassung";
"Remind me" = "Erinnere mich";
"Remind me via" = "Erinnere mich per";
"Remind Time" = "Zeit";
"Remind me when it's aired" = "Erinnere mich, wenn es übertragen wird.";
"Plan every time it's aired" = "Plan every time";
"Select Days" = "Choose days";
"Search Target" = "Suche in";
"Search Type" = "Kategorie suchen";
"Select Channel" = "Sender wählen";
"Minutes before" = "Minutes before";
"Hours before" = "Hours before";
"Days before" = "Days before";
"On days" = "On days";
"Weekdays(mon-fri)" = "Werktage";
"Weekends(sat-sun)" = "Wochenende";
"Mondays" = "Montags";
"Tuesdays" = "Dienstags";
"Wednesdays" = "Mittwochs";
"Thursdays" = "Donnerstags";
"Fridays" = "Freitags";
"Saturdays" = "Samstags";
"Sundays" = "Sonntags";
"All weekdays" = "Anytime";
"All hours" = "Anytime";
"Is" = "ist";
"Contains" = "beinhaltet";
"Begins with" = "beginnt mit";
"Ends with" = "endet mit";
"Between" = "Zwischen";
"On" = "onon";
"Show short summary in listings" = "Show short summary in listings";
"Settings" = "Einstellungen";
"From" = "Von";
"On channels" = "Sender";
"Plan all airings where" = "Alle Sendungen planen, bei denen";
"Limitations" = "Begrenzungen";
"Plans" = "Geplant";
"Plan" = "Planung";
"Find on IMDB" = "Search IMDB";
"Share on Facebook" = "Auf Facebook teilen";
"You post is now shared" = "You post is now shared";
"No records found" = "Es wurden keine Sendungen gefunden.";
"Please provide us with a valid email address" = "Bitte geben Sie eine gültige Emailadresse ein.";
"Please fill name, email and password as minimum" = "Please fill name, email and password as minimum";
"Disable commercials on TimeFor.TV (apps)" = "Werbung auf TimeFor.TV (apps) deaktivieren";
"Full version of TimeFor.TV for iPhone and iPad" = "TimeFor.TV-Vollversion für iPhone und iPad";
"Full version of TimeFor.TV for Android" = "TimeFor.TV-Vollversion für Andoid";
"Full version of TimeFor.TV for Windows" = "TimeFor.TV-Vollversion für Windows";
"Full version of TimeFor.TV for Facebook" = "TimeFor.TV-Vollversion für Facebook";
"Full version of TimeFor.TV for Mac" = "TimeFor.TV-Vollversion für Mac";
"Download EPG data as XMLTV for your media center" = "Laden Sie EPG-Daten im XMLTV-Format für Ihr Media-Center herunter.";
"Demands a TimeFor.TV Pro or TimeFor.TV+ subscription beginning at only EUR 5 an year" = "Fordert ein TimeFor.TV Pro oder ein TimeFor.TV+ Abonnement ab nur EUR 5 im Jahr";
"Functions" = "Features";
"EUR 5/year" = "EUR 5/year";
"EUR 15/year" = "EUR 15/year";